mdhardenburgh/Blinky/Packages/.cache/NXP.MKE02Z4_DFP.12.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE02Z4_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE02Z4</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="12.0.0" date="2019-06-10">NXP CMSIS packs based on MCUXpresso SDK 2.6.0</release>
    <release version="11.0.1" date="2019-04-26">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0" date="2018-12-19">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3" date="2018-07-16">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2" date="2018-05-25">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1" date="2018-04-04">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0" date="2018-01-19">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0" date="2017-11-17">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKE02Z4" Dvendor="NXP:11">
      <description>The Kinetis E series MCU portfolio maintain high-reliability and robustness in harsh electrical noise environments based on the ARM® Cortex®-M0+ core.</description>
      <device Dname="MKE02Z16xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="400000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE02Z16xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x4000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffffe00" size="0x0800" access="rw" default="1"/>
        <algorithm name="arm/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1ffffe00" RAMsize="0x00000800" default="1"/>
        <algorithm name="arm/MKE02Zxxx_P16KB.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1ffffe00" RAMsize="0x00000800" default="1"/>
        <debug svd="MKE02Z4.xml"/>
        <variant Dvariant="MKE02Z16VFM4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z16VFM4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z16VFM4/MKE02Z16xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z16VLC4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z16VLC4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z16VLC4/MKE02Z16xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z16VLD4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z16VLD4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z16VLD4/MKE02Z16xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKE02Z32xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="400000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE02Z32xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x8000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffffc00" size="0x1000" access="rw" default="1"/>
        <algorithm name="arm/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1ffffc00" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE02Zxxx_P32KB.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1ffffc00" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE02Z4.xml"/>
        <variant Dvariant="MKE02Z32VFM4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z32VFM4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z32VFM4/MKE02Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z32VLC4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z32VLC4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z32VLC4/MKE02Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z32VLD4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z32VLD4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z32VLD4/MKE02Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z32VLH4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z32VLH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z32VLH4/MKE02Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z32VQH4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z32VQH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z32VQH4/MKE02Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKE02Z64xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="400000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE02Z64xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffffc00" size="0x1000" access="rw" default="1"/>
        <algorithm name="arm/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1ffffc00" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE02Zxxx_P64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1ffffc00" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE02Z4.xml"/>
        <variant Dvariant="MKE02Z64VFM4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z64VFM4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z64VFM4/MKE02Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z64VLC4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z64VLC4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z64VLC4/MKE02Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z64VLD4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z64VLD4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z64VLD4/MKE02Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z64VLH4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z64VLH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z64VLH4/MKE02Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE02Z64VQH4">
          <compile header="fsl_device_registers.h" define="CPU_MKE02Z64VQH4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE02Z64VQH4/MKE02Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
