mdhardenburgh/Blinky/Packages/.cache/NXP.MKE02Z4_DFP.12.0.0.pdsc
    <condition id="device.MKE02Z4_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKE02Z4_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_1_AND_driver.port_ke02_AND_driver.uart_AND_utility.debug_console">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE02Z4_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="device.MKE02Z4_AND_driver.common">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE02Z4_AND_component.lists_AND_driver.common">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKE02Z4_AND_driver.uart">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKE02Z4_AND_driver.common_AND_driver.uart">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKE02Z4_AND_CMSIS_Include_core_cm0plus">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MKE02Z4_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE02Z4_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.spi">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE02Z4_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE02Z4_AND_device.MKE02Z4_CMSIS_AND_driver.clock">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE02Z4_startup"/>
    </condition>
    <condition id="device.MKE02Z4_AND_utility.debug_console">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKE02Z4_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE02Z4_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MKE02Z16???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z32???4*" Dvendor="NXP:11"/>
      <accept Dname="MKE02Z64???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
